<?xml version="1.0"?>
<net name="saved_model" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="?,224,224,3" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_order" version="0" value="0, 2, 3, 1" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,input_1:0">
					<dim>-1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_1/Transpose([0 3 1 2])/value1509718500" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="input_1/Transpose([0 3 1 2])" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>224</dim>
					<dim>224</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/resnet50/conv1_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 3, 7, 7" offset="32" size="37632" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv1_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/resnet50/conv1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="3, 3" pads_end="3, 3" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="data_add_12290" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="37664" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/resnet50/conv1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv1_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/resnet50/conv1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv1_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1532818497" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="37920" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="1533418311" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="37920" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_28" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="37952" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/resnet50/pool1_pad/Pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="StatefulPartitionedCall/resnet50/pool1_pad/Pad:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/resnet50/pool1_pool/MaxPool" type="MaxPool" version="opset8">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" kernel="3, 3" rounding_type="floor" auto_pad="valid" index_element_type="i64" axis="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>114</dim>
					<dim>114</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/pool1_pool/MaxPool:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/resnet50/conv2_block1_0_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="37956" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_0_conv/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/resnet50/conv2_block1_0_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="data_add_1231712322" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="103492" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/resnet50/conv2_block1_0_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_0_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/resnet50/conv2_block1_1_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 1, 1" offset="104516" size="16384" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_1_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/resnet50/conv2_block1_1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_1229312298" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="120900" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/resnet50/conv2_block1_1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_1_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/resnet50/conv2_block1_1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_1_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/resnet50/conv2_block1_2_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="121156" size="147456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_2_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/resnet50/conv2_block1_2_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_1230112306" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="268612" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/resnet50/conv2_block1_2_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_2_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/resnet50/conv2_block1_2_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_2_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/resnet50/conv2_block1_3_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="268868" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_3_conv/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/resnet50/conv2_block1_3_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="data_add_1230912314" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="334404" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/resnet50/conv2_block1_3_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_3_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/resnet50/conv2_block1_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_add/add:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/resnet50/conv2_block1_out/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block1_out/Relu:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/resnet50/conv2_block2_1_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="335428" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_1_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/resnet50/conv2_block2_1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_1232512330" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="400964" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/resnet50/conv2_block2_1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_1_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/resnet50/conv2_block2_1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_1_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/resnet50/conv2_block2_2_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="401220" size="147456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_2_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/resnet50/conv2_block2_2_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_1233312338" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="548676" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/resnet50/conv2_block2_2_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_2_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/resnet50/conv2_block2_2_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_2_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/resnet50/conv2_block2_3_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="548932" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_3_conv/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/resnet50/conv2_block2_3_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="data_add_1234112346" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="614468" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/resnet50/conv2_block2_3_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_3_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/resnet50/conv2_block2_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_add/add:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/resnet50/conv2_block2_out/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block2_out/Relu:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/resnet50/conv2_block3_1_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 256, 1, 1" offset="615492" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_1_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/resnet50/conv2_block3_1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_1234912354" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="681028" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/resnet50/conv2_block3_1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_1_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/resnet50/conv2_block3_1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_1_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/resnet50/conv2_block3_2_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="64, 64, 3, 3" offset="681284" size="147456" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_2_conv/Conv2D/ReadVariableOp:0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/resnet50/conv2_block3_2_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="data_add_1235712362" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64, 1, 1" offset="828740" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/resnet50/conv2_block3_2_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_2_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/resnet50/conv2_block3_2_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_2_relu/Relu:0">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/resnet50/conv2_block3_3_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="256, 64, 1, 1" offset="828996" size="65536" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_3_conv/Conv2D/ReadVariableOp:0">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/resnet50/conv2_block3_3_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>64</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_1236512370" type="Const" version="opset1">
			<data element_type="f32" shape="1, 256, 1, 1" offset="894532" size="1024" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/resnet50/conv2_block3_3_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_3_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/resnet50/conv2_block3_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_add/add:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/resnet50/conv2_block3_out/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv2_block3_out/Relu:0">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/resnet50/conv3_block1_0_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 256, 1, 1" offset="895556" size="524288" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_0_conv/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/resnet50/conv3_block1_0_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_1239712402" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="1419844" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/resnet50/conv3_block1_0_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_0_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/resnet50/conv3_block1_1_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 256, 1, 1" offset="1421892" size="131072" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_1_conv/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/resnet50/conv3_block1_1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>256</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="data_add_1237312378" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="1552964" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/resnet50/conv3_block1_1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_1_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/resnet50/conv3_block1_1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_1_relu/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/resnet50/conv3_block1_2_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="1553476" size="589824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_2_conv/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/resnet50/conv3_block1_2_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="data_add_1238112386" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="2143300" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/resnet50/conv3_block1_2_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_2_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/resnet50/conv3_block1_2_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_2_relu/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/resnet50/conv3_block1_3_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 128, 1, 1" offset="2143812" size="262144" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_3_conv/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/resnet50/conv3_block1_3_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="data_add_1238912394" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="2405956" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/resnet50/conv3_block1_3_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_3_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/resnet50/conv3_block1_add/add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_add/add:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/resnet50/conv3_block1_out/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block1_out/Relu:0">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/resnet50/conv3_block2_1_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 512, 1, 1" offset="2408004" size="262144" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_1_conv/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/resnet50/conv3_block2_1_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="data_add_1240512410" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="2670148" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/resnet50/conv3_block2_1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_1_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/resnet50/conv3_block2_1_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_1_relu/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/resnet50/conv3_block2_2_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="128, 128, 3, 3" offset="2670660" size="589824" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_2_conv/Conv2D/ReadVariableOp:0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/resnet50/conv3_block2_2_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="same_upper" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="data_add_1241312418" type="Const" version="opset1">
			<data element_type="f32" shape="1, 128, 1, 1" offset="3260484" size="512" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/resnet50/conv3_block2_2_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_2_bn/FusedBatchNormV3:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/resnet50/conv3_block2_2_relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_2_relu/Relu:0">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/resnet50/conv3_block2_3_bn/FusedBatchNormV3/mean/Fused_Mul__copy" type="Const" version="opset1">
			<data element_type="f32" shape="512, 128, 1, 1" offset="3260996" size="262144" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/resnet50/conv3_block2_3_conv/Conv2D/ReadVariableOp:0">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/resnet50/conv3_block2_3_conv/Conv2D" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="valid" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>512</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="data_add_1242112426" type="Const" version="opset1">
			<data element_type="f32" shape="1, 512, 1, 1" offset="3523140" size="2048" />
			<output>
